{
  "backend/main.mo": "Main Motoko actor implementing the tournament platform backend, including multi-admin access control, tournament/squad/player/payment management, room credential masking, and super admin auto-initialization on first login.",
  "backend/migration.mo": "Defines a no-op migration function that passes the existing stable state through unchanged, preserving all data maps and fields across upgrades.",
  "feature_evidence.json": "Feature evidence report mapping two frontend super admin auto-claim features to their implementing files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "Text file containing one-to-two sentence summaries of all frontend source files, serving as a reference index for the project's React component and hook structure.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes, including colors for background, foreground, primary, sidebar, and chart variables.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, setting the page title to 'Tournament Khelba' and mounting the app via the root div and main.tsx module script.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all application routes and, after login and actor initialization, silently attempts to claim super admin status by calling addAdmin, showing a success toast and invalidating admin queries if successful.",
  "frontend/src/components/admin/AdminDashboard.tsx": "Main admin dashboard component with tabbed navigation for Tournaments, Users, Payments, Results, and (for super admins) Admins panels. Redirects non-admins to home and shows loading skeletons while checking permissions.",
  "frontend/src/components/admin/AdminManagementSection.tsx": "Super-admin-only panel for viewing, adding, and removing admin principals. Validates principal IDs and uses mutation hooks to interact with the backend.",
  "frontend/src/components/admin/AdminSetup.tsx": "One-time setup page that allows the first authenticated user to claim the super admin role, auto-redirecting existing admins to the dashboard and blocking the claim if a super admin is already assigned.",
  "frontend/src/components/admin/PaymentManagementPanel.tsx": "Admin panel that lists pending payments and provides approve/reject actions with confirmation dialogs. Uses payment query hooks and displays payment details with formatted principals and timestamps.",
  "frontend/src/components/admin/ResultsUploadPanel.tsx": "Placeholder admin panel for uploading tournament results with a tournament selector and rank/kills/prize input fields for the top 5 players. The upload action is not yet implemented.",
  "frontend/src/components/admin/TournamentManagementPanel.tsx": "Admin panel for creating and editing tournaments, featuring a creation form and an edit modal that convert between datetime-local strings and nanosecond bigints for the backend. Uses tournament query hooks for data fetching and mutations.",
  "frontend/src/components/admin/UserManagementPanel.tsx": "Displays a list of mock registered users with their avatars, Free Fire UIDs, and tournament counts in a styled card panel.",
  "frontend/src/components/auth/LoginPage.tsx": "Full-page login screen for Tournament Khelba that authenticates users via Internet Identity with a styled button and branding assets.",
  "frontend/src/components/common/EmptyState.tsx": "Reusable empty state component that displays an icon, title, description, and optional action button when content is absent.",
  "frontend/src/components/common/ErrorDisplay.tsx": "Reusable alert component that renders error, warning, or info messages with appropriate icons, colors, and an optional action button.",
  "frontend/src/components/common/LoadingButton.tsx": "A button component that shows a spinning loader and optional loading text while a loading state is active, wrapping the shadcn Button.",
  "frontend/src/components/common/ModalTransition.tsx": "Thin wrapper that applies a zoom-in and fade-in CSS animation to modal content children.",
  "frontend/src/components/common/PageTransition.tsx": "Thin wrapper that applies a fade-in CSS animation to page-level content children.",
  "frontend/src/components/common/ProgressBar.tsx": "Displays a color-coded gradient progress bar that changes from green to orange to red based on fill percentage, with an optional label.",
  "frontend/src/components/common/QuickActionsMenu.tsx": "A floating action button in the bottom-right corner that expands to show quick navigation links for Tournaments, Wallet, Notifications, and Squads.",
  "frontend/src/components/common/SkeletonCard.tsx": "Renders skeleton placeholder cards in three layout variants (default, compact, wide) for use during loading states.",
  "frontend/src/components/common/SkeletonLoader.tsx": "Composes SkeletonCard instances into grid, list, dashboard, or form skeleton layouts based on the provided type prop.",
  "frontend/src/components/common/StatusBadge.tsx": "Renders a colored badge with an icon for tournament statuses: Open, Full, Started, or Completed.",
  "frontend/src/components/common/SuccessAnimation.tsx": "Full-screen overlay that displays an animated pulsing green checkmark for a configurable duration, then calls an optional completion callback.",
  "frontend/src/components/common/SuccessToast.tsx": "Exports helper functions to trigger styled success, error, and info toast notifications using the sonner library.",
  "frontend/src/components/layout/AppLayout.tsx": "Root layout wrapper that composes the Header, main content area, and Footer around page children.",
  "frontend/src/components/layout/Footer.tsx": "Site footer with branding, quick navigation links, social media icons, copyright, and a caffeine.ai attribution link.",
  "frontend/src/components/layout/Header.tsx": "Sticky top navigation header with logo, desktop navigation menu, and user authentication controls (login/logout) using Internet Identity, with admin and authenticated-only nav items.",
  "frontend/src/components/layout/MobileNav.tsx": "Slide-out sheet navigation for mobile screens, listing nav items conditionally based on auth/admin state, with login/logout functionality.",
  "frontend/src/components/leaderboard/LeaderboardPage.tsx": "Leaderboard page displaying mock top-player rankings with daily/weekly/monthly tabs, rank icons, and a demo-mode alert indicating the backend is not yet implemented.",
  "frontend/src/components/notifications/NotificationsPage.tsx": "Notifications page that fetches and displays user notifications with type-based icons and relative timestamps, supporting mark-as-read on click, with a demo-mode alert.",
  "frontend/src/components/profile/ProfilePage.tsx": "User profile page supporting create, view, edit, and delete operations on a player profile, with skeleton loading states and a prompt to create a profile if none exists.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "A modal dialog for creating or updating a user profile, with fields for display name, bio, email, phone, country, avatar URL, and notification/privacy preferences. Pre-fills form data from an existing profile and submits via create or update mutation hooks.",
  "frontend/src/components/referral/ReferralDashboard.tsx": "Displays the referral program dashboard showing the user's referral code (with copy button), referral stats (total referrals, completed, earnings), and a demo-mode alert indicating the backend is not yet implemented.",
  "frontend/src/components/results/TournamentResultsPage.tsx": "Shows mock tournament final standings for a given tournament ID, rendering ranked player cards with kill counts and prize amounts using hardcoded sample data and a demo-mode alert.",
  "frontend/src/components/sponsor/SponsorBanner.tsx": "A simple presentational banner component that displays a 'Proudly Sponsored by Code 11' section with a logo image and animated cyan glow styling.",
  "frontend/src/components/squads/CreateSquadModal.tsx": "A modal form for creating a new squad with a name and 2–5 character tag, submitting via the useCreateSquad mutation hook with validation and toast feedback.",
  "frontend/src/components/squads/InviteMemberModal.tsx": "A modal form that allows a squad captain to invite a player by name or Free Fire UID, submitting via the useInviteSquadMember mutation hook with toast feedback.",
  "frontend/src/components/squads/SquadsPage.tsx": "Displays the user's current squad details and pending invitations, with buttons to create a squad, invite members, or disband; uses CreateSquadModal and InviteMemberModal and shows a demo-mode alert.",
  "frontend/src/components/statistics/StatisticsDashboard.tsx": "Displays a player statistics dashboard with overview cards (tournaments, wins, win rate, kills, earnings) and line/bar charts, using sample/demo data fetched via a custom query hook.",
  "frontend/src/components/tournaments/BackendTournamentCard.tsx": "Renders a tournament card using backend data, showing game type, prize pool, entry fee, and time until start, with a link to the tournament detail page.",
  "frontend/src/components/tournaments/CommentsSection.tsx": "Displays a tournament discussion section with a comment list and a submission form that is only accessible to registered players, using query hooks for fetching and posting comments.",
  "frontend/src/components/tournaments/FeaturedTournamentsSection.tsx": "Renders a horizontally scrollable section of featured tournament cards with sponsor info, prize pool, entry fee, and slot availability details.",
  "frontend/src/components/tournaments/PracticeModeSection.tsx": "Displays a grid of zero-entry-fee practice match cards with an informational alert, showing an empty state message when no matches are available.",
  "frontend/src/components/tournaments/RegistrationSuccessModal.tsx": "A modal dialog shown after successful tournament registration, displaying the start time, room ID, and room password with copy-to-clipboard functionality.",
  "frontend/src/components/tournaments/TournamentCard.tsx": "Displays a single tournament's summary as a clickable card with mode, prize pool, entry fee, slot availability progress bar, and a countdown timer to the registration deadline.",
  "frontend/src/components/tournaments/TournamentDashboard.tsx": "Main tournament listing page that combines featured tournaments, practice matches, and a filterable/tabbed list of all upcoming tournaments with search and prize/fee filters.",
  "frontend/src/components/tournaments/TournamentDetailPage.tsx": "Full detail view for a single tournament showing metadata, registration/payment flow, and a room credentials section that reveals room ID and password to registered players based on a configurable time window before start.",
  "frontend/src/components/tournaments/TournamentFilters.tsx": "Filter panel component for tournaments providing search input, prize pool min/max range inputs, and entry fee bracket badge toggles, with a results count summary.",
  "frontend/src/components/wallet/TransactionList.tsx": "Renders a hardcoded mock list of wallet transactions (deposits, withdrawals, winnings, entry fees) with icons, status badges, and formatted amounts.",
  "frontend/src/components/wallet/WalletPage.tsx": "Wallet UI page showing a mock balance, deposit instructions, a withdrawal form, and the TransactionList component, with a demo-mode alert indicating backend is not yet implemented.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminCheck.ts": "Returns whether the currently authenticated user is an admin or super admin by combining results from useIsAdmin and useIsSuperAdmin queries.",
  "frontend/src/hooks/useAdminQueries.ts": "Provides React Query hooks for admin management operations including fetching, adding, removing admins, checking admin status, and claiming super admin role.",
  "frontend/src/hooks/useCountdown.ts": "Returns a formatted countdown string (days/hours/minutes) to a target date, updating every minute via an interval.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context provider and hook, managing AuthClient creation, login/logout flow, and persisting identity across page reloads.",
  "frontend/src/hooks/usePaymentQueries.ts": "Provides React Query hooks for payment operations including listing pending/tournament payments and submitting, approving, or rejecting payments via the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for user profile CRUD operations, profile completeness checks, and tournament payment registration against the backend actor.",
  "frontend/src/hooks/useTournamentFilters.ts": "Manages tournament list filtering state (search, prize range, entry fee brackets) and returns a memoized filtered array along with filter control functions.",
  "frontend/src/hooks/useTournamentQueries.ts": "Provides React Query hooks for tournament CRUD operations (list, get, create, update) and a stub hook for checking user registration status against the backend actor.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind base/components/utilities, defines OKLCH-based CSS custom properties for a dark gaming theme, and adds neon glow utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/utils/errorMessages.ts": "Utility that maps error strings from backend/network calls to structured user-friendly title/message/action objects for display in the UI.",
  "frontend/src/utils/formatters.ts": "Collection of formatting helpers for currency, numbers, dates, slot counts, and urgency checks used across the UI.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL query parameters from both regular and hash-based routes, persisting them in sessionStorage, and cleaning sensitive params from the address bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with OKLCH color tokens, neon gaming colors, glow box-shadows, accordion animations, and typography/container-queries/animate plugins.",
  "project_state.json": "Project state manifest tracking existing features, pending architectural requests, and metadata for the Tournament Khelba app, including the auto-assign super admin feature plan."
}