{
  "backend/main.mo": "Main Motoko actor defining all backend data models (Tournament, Payment, UserProfile, Squad, etc.) and shared functions for tournament management, payments, user profiles, notifications, and role-based access control with room credential masking.",
  "backend/migration.mo": "Migration module that upgrades Tournament records from an old schema (without room credentials) to a new schema by adding null roomId, roomPassword, and roomVisibilityMinutes fields.",
  "feature_evidence.json": "Feature evidence report mapping three implemented features—tournament management UI, useUpdateTournament hook, and TournamentDetailPage room credential auto-reveal—to their source files and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated JSON document summarizing each frontend source file's purpose and key implementation details for build planning reference.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, border, etc.) used throughout the app.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, setting the page title to 'Tournament Khelba' and mounting the app at the #root div.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all application routes (tournaments, wallet, profile, admin, squads, referrals, etc.) and wraps the app in ThemeProvider with dark mode defaulting.",
  "frontend/src/components/admin/AdminDashboard.tsx": "Admin dashboard page that verifies admin status via useAdminCheck, redirects non-admins to home with a toast error, and renders tabbed panels for Tournaments, Users, Payments, Results, and Admin Management.",
  "frontend/src/components/admin/AdminManagementSection.tsx": "Admin panel section for adding and removing admin principals, displaying the current user's principal ID with copy functionality and confirmation dialogs.",
  "frontend/src/components/admin/AdminSetup.tsx": "Initial admin setup page that allows the first user to register themselves as an admin by submitting their principal ID, then redirects to the admin dashboard.",
  "frontend/src/components/admin/PaymentManagementPanel.tsx": "Admin panel for listing pending payments and approving or rejecting them with confirmation dialogs, showing player principal, tournament ID, and submission time.",
  "frontend/src/components/admin/ResultsUploadPanel.tsx": "Placeholder admin panel UI for uploading tournament results (top 5 players with kills and prizes), with backend upload not yet implemented.",
  "frontend/src/components/admin/TournamentManagementPanel.tsx": "Admin panel for listing, creating, and editing tournaments, including a modal form with fields for dates, entry fee, prize pool, game type, and room credentials.",
  "frontend/src/components/admin/UserManagementPanel.tsx": "Admin panel displaying a static list of mock registered users with their Free Fire UIDs and tournament participation counts.",
  "frontend/src/components/auth/LoginPage.tsx": "Login page that authenticates users via Internet Identity, displaying the Tournament Khelba branding and a single login button.",
  "frontend/src/components/common/EmptyState.tsx": "Renders a centered empty state UI with an optional icon (Lucide or image), title, description, and an optional action button with gradient styling.",
  "frontend/src/components/common/ErrorDisplay.tsx": "Displays an alert message with configurable severity levels (error, warning, info), corresponding icons/colors, and an optional action button.",
  "frontend/src/components/common/LoadingButton.tsx": "A button component that shows a spinning loader and optional loading text when in a loading state, wrapping the shadcn Button with forwardRef support.",
  "frontend/src/components/common/ModalTransition.tsx": "A simple wrapper component that applies a zoom-in and fade-in CSS animation to modal content.",
  "frontend/src/components/common/PageTransition.tsx": "A simple wrapper component that applies a fade-in CSS animation to page content on render.",
  "frontend/src/components/common/ProgressBar.tsx": "Renders a gradient progress bar that changes color based on percentage (green/orange/red) with an optional filled/remaining label.",
  "frontend/src/components/common/QuickActionsMenu.tsx": "A fixed floating action button that expands to show quick navigation links (Tournaments, Wallet, Notifications, Squad) with animated reveal.",
  "frontend/src/components/common/SkeletonCard.tsx": "Renders skeleton loading placeholders in three variants (default, compact, wide) using shadcn Skeleton components styled for the dark theme.",
  "frontend/src/components/common/SkeletonLoader.tsx": "Composes SkeletonCard components into full-page loading layouts for grid, list, dashboard, and form content types.",
  "frontend/src/components/common/StatusBadge.tsx": "Displays a styled badge for tournament statuses (Open, Full, Started, Completed) with matching colors, glow effects, and icons.",
  "frontend/src/components/common/SuccessAnimation.tsx": "Shows a full-screen animated success checkmark overlay that auto-dismisses after a configurable duration and calls an optional onComplete callback.",
  "frontend/src/components/common/SuccessToast.tsx": "Exports helper functions to trigger styled success, error, and info toast notifications using the sonner library.",
  "frontend/src/components/layout/AppLayout.tsx": "Root layout component that wraps page content with a Header, Footer, and a dark gradient background container.",
  "frontend/src/components/layout/Footer.tsx": "Site footer displaying the brand logo, quick navigation links, social media icons, copyright, and a caffeine.ai attribution link.",
  "frontend/src/components/layout/Header.tsx": "Sticky site header with navigation links, admin-conditional menu item, notification bell with unread badge, and a user dropdown menu with logout support.",
  "frontend/src/components/layout/MobileNav.tsx": "A slide-out mobile navigation drawer using a Sheet component, rendering links to all main app routes (Tournaments, Wallet, Profile, etc.) with an unread notification badge and a conditional Admin Panel link for admin users.",
  "frontend/src/components/leaderboard/LeaderboardPage.tsx": "Displays a leaderboard page with daily/weekly/monthly tabs using hardcoded mock player data, showing rank icons, points, and wins with a demo-mode alert banner.",
  "frontend/src/components/notifications/NotificationsPage.tsx": "Renders a notifications list page that fetches notifications via a query hook, displays type-specific icons and relative timestamps, and marks notifications as read on click.",
  "frontend/src/components/profile/ProfilePage.tsx": "Full profile management page supporting create, view, edit, and delete operations for a user profile, with loading skeletons and a prompt to create a profile if none exists.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "A modal dialog for creating or updating a user profile, pre-filling fields from existing profile data and submitting via create/update mutation hooks.",
  "frontend/src/components/referral/ReferralDashboard.tsx": "Displays a referral program dashboard with a copyable referral code, stats cards (total referrals, earnings, pending), and a demo-mode alert indicating the backend is not yet implemented.",
  "frontend/src/components/results/TournamentResultsPage.tsx": "Displays a tournament results page with mock final standings showing player rank, kills, and prize data with rank-specific styling for top 3 positions.",
  "frontend/src/components/sponsor/SponsorBanner.tsx": "Renders a styled sponsor banner displaying the Code 11 logo with animated cyan glow effects.",
  "frontend/src/components/squads/CreateSquadModal.tsx": "Modal dialog for creating a new squad with name and tag inputs, validating tag length and submitting via the useCreateSquad mutation hook.",
  "frontend/src/components/squads/InviteMemberModal.tsx": "Modal dialog for inviting a player to a squad by name or UID, submitting via the useInviteSquadMember mutation hook.",
  "frontend/src/components/squads/SquadsPage.tsx": "Page component displaying the current user's squad info, pending invitations, and buttons to create a squad or invite members via modals.",
  "frontend/src/components/statistics/StatisticsDashboard.tsx": "Dashboard displaying mock player statistics (tournaments, wins, win rate, kills, earnings) with overview cards and Recharts line/bar charts.",
  "frontend/src/components/tournaments/BackendTournamentCard.tsx": "Card component for a single tournament fetched from the backend, displaying game type, name, prize pool, entry fee, and time until start with a link to the tournament detail page.",
  "frontend/src/components/tournaments/CommentsSection.tsx": "Renders a tournament discussion section with a comment submission form (visible only to registered players) and a list of existing comments with relative timestamps.",
  "frontend/src/components/tournaments/FeaturedTournamentsSection.tsx": "Displays a horizontally scrollable row of featured tournament cards with prize pool, entry fee, slots, and sponsor details highlighted with a gold/orange theme.",
  "frontend/src/components/tournaments/PracticeModeSection.tsx": "Renders a grid of zero-entry-fee practice match cards with an informational alert banner and an empty state when no matches are available.",
  "frontend/src/components/tournaments/RegistrationSuccessModal.tsx": "A modal dialog shown after successful tournament registration that displays the tournament start time, room ID, and room password with copy-to-clipboard buttons.",
  "frontend/src/components/tournaments/TournamentCard.tsx": "A linked card component displaying a single tournament's mode, prize pool, entry fee, slot progress, and countdown timer with status badge and urgency indicators.",
  "frontend/src/components/tournaments/TournamentDashboard.tsx": "The main tournament listing page combining a hero banner, featured tournaments, sponsor banner, mode tabs, collapsible filters, and a filtered grid of tournament cards fetched from the backend.",
  "frontend/src/components/tournaments/TournamentDetailPage.tsx": "Displays a detailed view of a single tournament including dates, prize pool, registration status, and a room credentials section that reveals room ID/password to registered users based on a configurable time window before the tournament starts.",
  "frontend/src/components/tournaments/TournamentFilters.tsx": "A filter panel component for the tournament list that provides search, prize pool range inputs, and entry fee bracket toggles, along with a results count display and a clear-all button.",
  "frontend/src/components/wallet/TransactionList.tsx": "Renders a list of mock wallet transactions (deposits, withdrawals, winnings, entry fees) with icons, status badges, and formatted amounts using hardcoded sample data.",
  "frontend/src/components/wallet/WalletPage.tsx": "A wallet UI page showing a mock balance, deposit instructions, a withdrawal form, and a transaction history list, with a demo-mode alert indicating the backend is not yet implemented.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an authenticated or anonymous ICP backend actor using TanStack Query, reinitializing and invalidating dependent queries whenever the Internet Identity changes.",
  "frontend/src/hooks/useCountdown.ts": "A React hook that computes and updates a human-readable countdown string (days, hours, minutes) to a target date, refreshing every minute.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook for ICP, managing AuthClient creation, login, logout, and identity persistence with status tracking across the React component tree.",
  "frontend/src/hooks/usePaymentQueries.ts": "Provides React Query hooks for payment operations including listing pending payments, listing payments by tournament, and mutations for approving, rejecting, and submitting payments.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for user profile CRUD operations (get, create, update, delete) and legacy authorization profile hooks, along with a profile completeness query.",
  "frontend/src/hooks/useTournamentFilters.ts": "Custom hook that manages tournament filtering state (search query, prize range, entry fee brackets) and returns memoized filtered tournament results.",
  "frontend/src/hooks/useTournamentQueries.ts": "Provides React Query hooks for tournament operations including listing, fetching a single tournament, creating, updating, and checking user registration status.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives, defines CSS custom properties for a dark-themed design system, and adds utility glow classes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/errorMessages.ts": "Utility that maps error strings to structured user-friendly error messages with titles, descriptions, and suggested actions for various error types.",
  "frontend/src/utils/formatters.ts": "Utility functions for formatting currency, numbers, dates, slot counts, and computing slot/deadline urgency indicators.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routing, with sessionStorage persistence helpers and hash cleanup.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom colors (including gaming neon palette), border radius, box shadows, animations, and enabling dark mode, typography, container queries, and animate plugins.",
  "project_state.json": "Project state tracking file describing a tournament platform with features for admin tournament management, manual Room ID/Password entry, configurable visibility windows, and auto-reveal logic, along with versioning and feature request statuses."
}