{
  "kind": "build_request",
  "title": "Auto-assign super admin to first login",
  "projectName": "Tournament Khelba",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Modify the backend so that when no super admin has been set yet, the first user to successfully authenticate and call any admin-check or initialization function is automatically assigned as the super admin. The super admin principal should be stored in stable state and persist across upgrades.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "I don't have the principal I'd",
          "set up the app so that the first user to log in is automatically assigned as super admin"
        ]
      },
      "acceptanceCriteria": [
        "If superAdmin is null/unset in backend state, the first authenticated principal to trigger the initialization path is stored as superAdmin.",
        "Subsequent logins do not overwrite the existing superAdmin.",
        "The assigned super admin principal persists across canister upgrades via the migration module.",
        "isAdmin and isSuperAdmin queries return true for the automatically assigned principal."
      ]
    },
    {
      "id": "REQ-2",
      "text": "On the frontend, after a user logs in via Internet Identity, automatically call the backend super admin initialization endpoint. If the call succeeds and the user is now the super admin, redirect them to the admin dashboard and show a success toast indicating they have been assigned as super admin.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "first user to log in is automatically assigned as super admin"
        ]
      },
      "acceptanceCriteria": [
        "After login, the app silently attempts to claim super admin if none exists.",
        "If the logged-in user becomes super admin, a success toast is displayed (e.g., 'You have been assigned as Super Admin').",
        "The admin dashboard becomes accessible immediately after auto-assignment without requiring a page refresh.",
        "If a super admin already exists, no claim attempt UI or error is shown to regular users."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the AdminSetup page so that instead of asking the user to manually enter their principal ID, it displays an explanation that the first user to log in will automatically become super admin, with a 'Log In & Claim Super Admin' button that triggers Internet Identity login.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "I don't have the principal I'd"
        ]
      },
      "acceptanceCriteria": [
        "AdminSetup no longer shows a manual principal ID input field.",
        "A clear message explains the auto-assignment behavior.",
        "A prominent call-to-action button initiates the Internet Identity login flow.",
        "If super admin is already assigned and the current user is not super admin, the page shows an appropriate message."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "Super admin auto-assignment must only fire once — subsequent logins must never overwrite an already-set super admin.",
    "Migration module must be updated to ensure superAdmin stable state is preserved on upgrade."
  ],
  "nonGoals": [
    "Manual principal ID entry for super admin assignment.",
    "Email-based authentication or identity lookup.",
    "Adding new super admin permissions beyond what is already defined."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}