{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Auto-assign super admin to first login",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "After login, automatically attempt to claim super admin if none exists, show success toast if assigned, and enable admin dashboard access immediately",
      "acceptanceCriteria": [
        "After login, the app silently attempts to claim super admin if none exists.",
        "If the logged-in user becomes super admin, a success toast is displayed (e.g., 'You have been assigned as Super Admin').",
        "The admin dashboard becomes accessible immediately after auto-assignment without requiring a page refresh.",
        "If a super admin already exists, no claim attempt UI or error is shown to regular users."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Add logic to automatically call a super admin initialization check after the actor is created for an authenticated user. If the backend indicates the user has become super admin, invalidate the admin-related queries to refresh permissions immediately. This ensures the admin dashboard becomes accessible without requiring a manual page refresh."
        },
        {
          "path": "frontend/src/hooks/useAdminQueries.ts",
          "operation": "modify",
          "description": "Add a new mutation hook `useClaimSuperAdmin` that calls the backend super admin initialization capability. This hook should handle both success (user is now super admin) and silent failure (super admin already exists) cases. On success, the hook should display a success toast ('You have been assigned as Super Admin') and invalidate admin permission queries."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "After successful Internet Identity login, trigger the super admin claim attempt using the new hook. If the claim succeeds and the user becomes super admin, display the success toast and ensure the router can immediately navigate to admin routes without a refresh. Handle the flow so that if a super admin already exists, no error or UI feedback is shown to the user."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Replace manual principal ID entry in AdminSetup with an explanation of auto-assignment and a 'Log In & Claim Super Admin' button that triggers Internet Identity login",
      "acceptanceCriteria": [
        "AdminSetup no longer shows a manual principal ID input field.",
        "A clear message explains the auto-assignment behavior.",
        "A prominent call-to-action button initiates the Internet Identity login flow.",
        "If super admin is already assigned and the current user is not super admin, the page shows an appropriate message."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/AdminSetup.tsx",
          "operation": "modify",
          "description": "Remove the principal ID input field and submission form. Replace with an explanation card that describes the auto-assignment behavior: 'The first user to log in will automatically become the Super Admin.' Add a prominent 'Log In & Claim Super Admin' button that triggers the Internet Identity login flow. Use the useInternetIdentity hook to handle login. After login, the auto-assignment logic in useActor will handle the claim attempt. If a super admin already exists and the current user is not the super admin, display a message like 'Super Admin has already been assigned' with no action button."
        },
        {
          "path": "frontend/src/components/admin/AdminSetup.tsx",
          "operation": "modify",
          "description": "Add a query to check if a super admin already exists using the getSuperAdmin backend capability. Display different UI states based on: (1) No super admin exists and user is not logged in – show login button, (2) No super admin exists and user is logged in – show loading or redirect to dashboard after claim, (3) Super admin exists and current user is not super admin – show 'already assigned' message, (4) Current user is super admin – redirect to admin dashboard."
        }
      ]
    }
  ]
}