{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "App with multi-admin setup and super admin controls. Super admin will be automatically assigned to the first user who logs in via Internet Identity.",
  "architectural_notes": [
    "Uses Internet Identity for authentication; super admin is identified by principal ID",
    "First login will be automatically assigned super admin role (no hardcoded principal ID)"
  ],
  "known_issues": [],
  "isFixRequest": false,
  "existing_features": [
    {
      "id": "feature-on-the-frontend-after-a-user-logs-in-via-internet-identity-automatically-call-the-backend-super-admin-initialization-endpoint-if-the-call-succeeds-and-the-user-is-now-the-super-admin-redirect-them-to-the-admin-dashboard-and-show-a-success-toast-indicating-they-have-been-assigned-as-super-admin",
      "title": "On the frontend, after a user logs in via Internet Identity, automatically call the backend super admin initialization endpoint. If the call succeeds and the user is now the super admin, redirect them to the admin dashboard and show a success toast indicating they have been assigned as super admin.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-adminsetup-page-so-that-instead-of-asking-the-user-to-manually-enter-their-principal-id-it-displays-an-explanation-that-the-first-user-to-log-in-will-automatically-become-super-admin-with-a-log-in-claim-super-admin-button-that-triggers-internet-identity-login",
      "title": "Update the AdminSetup page so that instead of asking the user to manually enter their principal ID, it displays an explanation that the first user to log in will automatically become super admin, with a 'Log In & Claim Super Admin' button that triggers Internet Identity login.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Assign super admin role automatically to the first user who logs in",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Modify the backend so that when no super admin has been set yet, the first user to successfully authenticate and call any admin-check or initialization function is automatically assigned as the super admin. The super admin principal should be stored in stable state and persist across upgrades.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    }
  ],
  "gameProjectType": "none",
  "projectName": "Tournament Khelba",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}