{
  "backend/main.mo": "Main actor with blob storage, access control, and state for notifications, referrals, squads, and player profiles; includes legacy tournament registration and profile completeness checks for backward compatibility.",
  "backend/migration.mo": "Migration module that preserves existing playerProfiles and initializes empty maps for notifications, referrals, and squads during canister upgrades.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including notifications center, statistics dashboard, tournament filtering, and their associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files describing React components for authentication, tournaments, wallet, profile, leaderboard, admin panels, and styling with dark gaming theme.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color system, defining colors for UI components, charts, and sidebar.",
  "frontend/index.html": "HTML entry point for the Tournament Khelba application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component with TanStack Router configuration for all routes (tournaments, wallet, profile, leaderboard, admin, notifications, statistics, squads, referrals) and authentication flow with loading states.",
  "frontend/src/components/admin/AdminDashboard.tsx": "Admin dashboard with permission checking, tabbed interface for tournament, user, payment, and results management panels, and demo mode alert.",
  "frontend/src/components/admin/PaymentManagementPanel.tsx": "Displays a list of pending payment requests (deposits/withdrawals) with approve/reject buttons. Currently uses mock data and shows toast notifications for unimplemented backend actions.",
  "frontend/src/components/admin/ResultsUploadPanel.tsx": "Provides a form for admins to upload tournament results including tournament selection and top 5 player rankings with kills and prizes. Backend integration is not yet implemented.",
  "frontend/src/components/admin/TournamentManagementPanel.tsx": "Admin panel for creating and managing tournaments with fields for game mode, entry fee, prize pool, slots, start time, room ID and password. Shows existing tournaments in a list with edit/delete actions (backend pending).",
  "frontend/src/components/admin/UserManagementPanel.tsx": "Displays a list of registered users showing their avatar, name, Free Fire UID, and tournament participation count using mock data.",
  "frontend/src/components/auth/LoginPage.tsx": "Login page with Internet Identity authentication, featuring Tournament Khelba branding and Code 11 presentation. Includes loading states and secure authentication messaging.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper component that combines Header, Footer, and main content area with gradient background styling.",
  "frontend/src/components/layout/Footer.tsx": "Footer component with Tournament Khelba branding, quick navigation links, social media icons, and caffeine.ai attribution. Includes Code 11 presentation logo.",
  "frontend/src/components/layout/Header.tsx": "Navigation header with logo, main menu links (Tournaments, Leaderboard, Squad, Wallet), admin access for authorized users, notification bell with unread count, and user profile dropdown with logout functionality.",
  "frontend/src/components/leaderboard/LeaderboardPage.tsx": "Displays a leaderboard with mock data showing top 10 players ranked by points and wins, with daily/weekly/monthly tabs and special styling for top 3 ranks.",
  "frontend/src/components/notifications/NotificationsPage.tsx": "Shows user notifications with different types (reminders, results, confirmations, updates), supports marking as read, and displays relative timestamps.",
  "frontend/src/components/profile/ProfilePage.tsx": "User profile page displaying player stats, Free Fire UID, tournament history, and editable profile fields with mock data.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal dialog for setting up or completing user profile with name and Free Fire UID fields, integrated with backend queries.",
  "frontend/src/components/referral/ReferralDashboard.tsx": "Referral program dashboard showing referral code, stats (total referrals, earnings, pending), and copy-to-clipboard functionality.",
  "frontend/src/components/results/TournamentResultsPage.tsx": "Displays tournament final standings with mock data, showing player rankings, kills, and prizes with trophy icons for top 3 positions.",
  "frontend/src/components/squads/CreateSquadModal.tsx": "Modal dialog for creating a new squad with name and tag (2-5 characters) validation, using React Query mutation and toast notifications.",
  "frontend/src/components/squads/InviteMemberModal.tsx": "Modal dialog for inviting players to a squad by name or UID, using React Query mutation for invitation submission.",
  "frontend/src/components/squads/SquadsPage.tsx": "Main squad management page displaying current squad info, pending invitations, member list, and actions to create/invite/disband squads.",
  "frontend/src/components/statistics/StatisticsDashboard.tsx": "Player statistics dashboard showing tournament metrics, win rates, kills, earnings with overview cards and charts using Recharts library.",
  "frontend/src/components/tournaments/CommentsSection.tsx": "Tournament discussion section allowing registered users to post and view comments with timestamps, using React Query for data fetching and mutations.",
  "frontend/src/components/tournaments/FeaturedTournamentsSection.tsx": "Displays a horizontally scrollable section of featured tournaments with premium styling, including sponsor badges, prize pools, entry fees, and registration buttons. Uses special visual effects like gradient borders and glow effects to highlight featured status.",
  "frontend/src/components/tournaments/PracticeModeSection.tsx": "Renders a grid of practice mode tournaments with zero entry fees and no prizes, displaying an informational alert and handling empty states. Uses TournamentCard component with isPracticeMode flag.",
  "frontend/src/components/tournaments/TournamentCard.tsx": "Reusable card component displaying tournament details (mode, entry fee, prize pool, slots, start time) with conditional styling for practice vs regular tournaments. Includes progress bar for slot availability and links to tournament detail page.",
  "frontend/src/components/tournaments/TournamentDashboard.tsx": "Main tournament listing page with hero banner, featured tournaments section, practice mode section, and filterable regular tournaments organized by game mode tabs. Includes collapsible filter panel and demo mode alerts.",
  "frontend/src/components/tournaments/TournamentDetailPage.tsx": "Detailed view of a single tournament showing full information, registration button with profile completeness check, and comments section. Handles tournament not found state and displays demo mode alerts.",
  "frontend/src/components/tournaments/TournamentFilters.tsx": "Filter panel component providing search, prize pool range inputs, entry fee bracket badges, and clear filters functionality. Displays filtered results count and uses controlled inputs for all filter states.",
  "frontend/src/components/wallet/TransactionList.tsx": "Displays a list of mock wallet transactions (deposits, withdrawals, winnings, entry fees) with icons, status badges, and formatted dates/amounts.",
  "frontend/src/components/wallet/WalletPage.tsx": "Wallet page component showing mock balance, deposit/withdrawal UI, and transaction history with alerts indicating backend is not yet implemented.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout, managing identity state and AuthClient lifecycle with delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, tournaments, admin checks, notifications, and player statistics with mock data fallbacks for unimplemented backend features.",
  "frontend/src/hooks/useTournamentFilters.ts": "Custom hook providing tournament filtering logic by search query, prize pool range, and entry fee brackets with memoized results.",
  "frontend/src/index.css": "Tailwind CSS configuration with dark theme color variables, custom glow utilities, and typography settings for the gaming platform UI.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, gaming-themed neon colors with glow effects, container queries, typography plugin, and accordion animations.",
  "project_state.json": "Project state document for Tournament Khelba, a Free Fire tournament platform on Internet Computer with manual wallet system, squad management, and admin-controlled leaderboards; includes architectural notes, known limitations, and existing feature tracking."
}