{
  "backend/main.mo": "Main backend actor that includes blob storage and authorization mixins, manages admin roles via access control, and maintains legacy state for notifications, referrals, squads, and player profiles with tournament registration and profile completeness checks.",
  "feature_evidence.json": "Feature evidence report documenting implementation of skeleton loading screens, error messages, and empty state screens across major pages with high confidence ratings and associated test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including authentication, admin dashboard with access control, tournament management, wallet, profile, leaderboard, and new features like notifications, statistics, squads, and referrals.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system variables for light and dark themes with gaming-themed colors including neon accents.",
  "frontend/index.html": "HTML entry point for the Tournament Khelba application with root div and module script reference.",
  "frontend/src/App.tsx": "Main React application component using TanStack Router with routes for tournaments, wallet, profile, leaderboard, admin, notifications, statistics, squads, and referrals, with Internet Identity authentication flow and loading states.",
  "frontend/src/components/admin/AdminDashboard.tsx": "Admin dashboard component with access control that checks admin status via useAdminCheck hook, redirects non-admin users with error toast, and provides tabs for tournament, user, payment, results, and admin management.",
  "frontend/src/components/admin/AdminManagementSection.tsx": "Admin management UI component that allows adding and removing admin principals, displaying the current user's principal ID with copy functionality, and enforcing at least one admin must remain.",
  "frontend/src/components/admin/AdminSetup.tsx": "Initial admin setup component for when the admin list is empty, allowing users to copy their principal ID and add themselves as the first admin.",
  "frontend/src/components/admin/PaymentManagementPanel.tsx": "Admin panel for managing pending payment requests (deposits/withdrawals) with approve/reject actions, currently using mock data with backend not yet implemented.",
  "frontend/src/components/admin/ResultsUploadPanel.tsx": "Admin interface for uploading tournament results including player rankings, kills, and prizes for top 5 players, with backend functionality pending implementation.",
  "frontend/src/components/admin/TournamentManagementPanel.tsx": "Admin panel for creating and managing tournaments with form inputs for game mode, entry fee, prize pool, slots, start time, room ID and password, backend not yet implemented.",
  "frontend/src/components/admin/UserManagementPanel.tsx": "Displays a list of registered users with their Free Fire UID and tournament participation count using mock data.",
  "frontend/src/components/auth/LoginPage.tsx": "Landing page with Internet Identity authentication, featuring Tournament Khelba branding and Code 11 presentation with gradient styling and loading states.",
  "frontend/src/components/common/EmptyState.tsx": "Reusable empty state component that displays an icon, title, description, and optional action button for when no data is available.",
  "frontend/src/components/common/ErrorDisplay.tsx": "A reusable error/warning/info alert component with customizable severity levels, icons, titles, messages, and optional action buttons.",
  "frontend/src/components/common/LoadingButton.tsx": "A button component that displays a loading spinner and optional loading text when in a loading state, extending the base Button component.",
  "frontend/src/components/common/ModalTransition.tsx": "A wrapper component that applies zoom-in and fade-in animations to modal content.",
  "frontend/src/components/common/PageTransition.tsx": "A wrapper component that applies fade-in animation to page content during transitions.",
  "frontend/src/components/common/ProgressBar.tsx": "A progress bar component with color-coded gradients based on percentage, optional labels showing filled/remaining values, and smooth transitions.",
  "frontend/src/components/common/QuickActionsMenu.tsx": "A floating action button menu in the bottom-right corner that expands to show quick navigation links to tournaments, wallet, notifications, and squads.",
  "frontend/src/components/common/SkeletonCard.tsx": "A skeleton loading placeholder component with three variants (default, compact, wide) for displaying loading states of card-based content.",
  "frontend/src/components/common/SkeletonLoader.tsx": "A skeleton loader component that renders multiple SkeletonCards in different layouts (grid, list, dashboard, form) for various loading states.",
  "frontend/src/components/common/StatusBadge.tsx": "A badge component displaying tournament status (Open, Full, Started, Completed) with color-coded styling, icons, and glow effects.",
  "frontend/src/components/common/SuccessAnimation.tsx": "A full-screen success animation overlay with a pulsing checkmark icon that auto-dismisses after a configurable duration.",
  "frontend/src/components/common/SuccessToast.tsx": "Utility functions for displaying styled toast notifications (success, error, info) using the sonner library with custom styling.",
  "frontend/src/components/layout/AppLayout.tsx": "The main application layout wrapper that includes the header, footer, and a container for page content with gradient background.",
  "frontend/src/components/layout/Footer.tsx": "The application footer with branding, quick links, social media icons, copyright notice, and attribution to Code 11 and caffeine.ai.",
  "frontend/src/components/layout/Header.tsx": "The main navigation header with logo, navigation links, notification bell with unread count badge, user dropdown menu, and authentication controls.",
  "frontend/src/components/layout/MobileNav.tsx": "Mobile navigation drawer component using Sheet UI, displaying navigation links for tournaments, wallet, profile, leaderboard, notifications (with unread badge), squads, statistics, referrals, and admin panel (conditionally shown for admins).",
  "frontend/src/components/leaderboard/LeaderboardPage.tsx": "Leaderboard page displaying top 10 players with mock data, featuring daily/weekly/monthly tabs, rank icons (trophy/medal/award for top 3), and player stats including points and wins.",
  "frontend/src/components/notifications/NotificationsPage.tsx": "Notifications page that fetches and displays user notifications with icons based on type (reminder, result, confirmation, update), supports marking as read on click, and shows relative timestamps.",
  "frontend/src/components/profile/ProfilePage.tsx": "User profile page displaying mock player stats (tournaments played, wins, kills, rank, points), recent tournament results, and editable Free Fire UID with local state management.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal dialog for setting up or completing user profile with name and Free Fire UID fields, pre-fills existing data, and calls mutation to save profile with success callback support.",
  "frontend/src/components/referral/ReferralDashboard.tsx": "Referral program dashboard displaying user's referral code with copy functionality, stats for total referrals and earnings, and a promotional banner explaining the reward system.",
  "frontend/src/components/results/TournamentResultsPage.tsx": "Displays tournament final standings with mock data, showing player rankings, kills, and prizes with styled cards for top 3 positions using trophy icons and gradient backgrounds.",
  "frontend/src/components/sponsor/SponsorBanner.tsx": "Renders a styled sponsor banner component displaying the Code 11 logo with animated gradient effects and glowing borders.",
  "frontend/src/components/squads/CreateSquadModal.tsx": "Modal dialog for creating a new squad with name and tag inputs, using React Query mutation and form validation with toast notifications.",
  "frontend/src/components/squads/InviteMemberModal.tsx": "Modal dialog for inviting players to a squad by name or UID, using React Query mutation with success/error toast feedback.",
  "frontend/src/components/squads/SquadsPage.tsx": "Main squad management page displaying current squad info, member list, invitations, and actions to create/invite/disband squads with demo mode alert.",
  "frontend/src/components/statistics/StatisticsDashboard.tsx": "Player statistics dashboard showing tournament metrics, win rates, kills, and earnings with stat cards and charts using Recharts library.",
  "frontend/src/components/tournaments/CommentsSection.tsx": "Tournament discussion section allowing registered users to post and view comments with timestamps, using React Query for data fetching and mutations.",
  "frontend/src/components/tournaments/FeaturedTournamentsSection.tsx": "Displays a horizontally scrollable list of featured tournaments with special styling, badges, sponsor information, and prominent visual indicators like yellow/orange gradients and glowing effects.",
  "frontend/src/components/tournaments/PracticeModeSection.tsx": "Renders a grid of practice mode tournaments with zero entry fees, displaying an informational alert and empty state when no matches are available.",
  "frontend/src/components/tournaments/RegistrationSuccessModal.tsx": "Modal dialog shown after successful tournament registration, displaying room ID and password with copy-to-clipboard functionality and tournament start time.",
  "frontend/src/components/tournaments/TournamentCard.tsx": "Reusable card component displaying tournament details including mode, prize pool, entry fee, slots remaining, countdown timer, and status badge with hover effects and navigation link.",
  "frontend/src/components/tournaments/TournamentDashboard.tsx": "Main dashboard page with hero banner, sponsor section, featured tournaments, tabbed navigation for game modes, collapsible filters, and grid display of regular tournaments with loading and empty states.",
  "frontend/src/components/tournaments/TournamentDetailPage.tsx": "Detailed view of a single tournament showing full information, registration button with profile completeness check, room credentials, and comments section with demo mode alert.",
  "frontend/src/components/tournaments/TournamentFilters.tsx": "React component providing tournament filtering UI with search, prize pool range, entry fee brackets, and a results counter. Displays filters in a styled card with clear-all functionality.",
  "frontend/src/components/wallet/TransactionList.tsx": "Displays a list of mock wallet transactions (deposits, withdrawals, winnings, entry fees) with icons, status badges, and formatted dates. Uses hardcoded sample data for demonstration.",
  "frontend/src/components/wallet/WalletPage.tsx": "Wallet page component showing mock balance, deposit/withdrawal cards, and transaction history. Includes demo mode alerts indicating backend is not yet implemented.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor instance using Internet Identity authentication. Handles actor initialization with admin token and invalidates dependent queries on identity changes.",
  "frontend/src/hooks/useCountdown.ts": "Custom hook that calculates and formats time remaining until a target date, updating every minute. Returns formatted countdown strings like '2d 5h' or 'Closing soon'.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity storage, and AuthClient lifecycle. Includes provider component and useInternetIdentity hook for accessing auth state.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, tournament registration, admin checks, and principal management. Wraps backend actor calls with caching, loading states, and automatic query invalidation.",
  "frontend/src/hooks/useTournamentFilters.ts": "Custom React hook that provides tournament filtering logic by search query, prize pool range, and entry fee brackets, with memoized results and filter management functions.",
  "frontend/src/index.css": "Global CSS file defining Tailwind directives, CSS custom properties for theming (colors, radius), typography styles using Inter font, and utility classes for glow effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/src/utils/errorMessages.ts": "Error handling utility that maps various error types (profile incomplete, insufficient balance, tournament full, etc.) to user-friendly error messages with titles and suggested actions.",
  "frontend/src/utils/formatters.ts": "Utility functions for formatting currency (Bangladeshi Taka), numbers, dates, tournament slots, and checking urgency conditions for deadlines and slot availability.",
  "frontend/src/utils/urlParams.ts": "URL parameter utilities for extracting query parameters from hash-based or regular URLs, persisting parameters in sessionStorage, and cleaning sensitive data from the address bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme with OKLCH colors for gaming theme (neon cyan/green/orange), extended utilities for glow effects, animations, and container settings.",
  "project_state.json": "Project metadata documenting Tournament Khelba architecture (Motoko backend, React frontend, Internet Identity auth), known limitations (no real-time features, manual payment tracking), and implemented features list."
}