{
  "backend/main.mo": "Main backend actor that includes blob storage and authorization mixins, implements admin management functions (addAdmin, removeAdmin, isAdmin), and maintains legacy notification, referral, squad, and player profile state with tournament registration logic.",
  "feature_evidence.json": "Feature evidence report documenting five admin-related features including useAdminCheck hook updates, AdminDashboard access control, Header navigation hiding, AdminSetup component creation, and admin management section additions.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including admin management hooks in useQueries.ts, access-controlled AdminDashboard with redirect logic, and Header component that conditionally shows Admin link based on admin status.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system variables for light and dark themes with gaming-themed colors including sidebar, chart, and destructive color tokens.",
  "frontend/index.html": "HTML entry point for the Tournament Khelba application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main application component using TanStack Router with routes for tournaments, wallet, profile, leaderboard, results, admin, notifications, statistics, squads, and referrals, wrapped in ThemeProvider with authentication flow and loading states.",
  "frontend/src/components/admin/AdminDashboard.tsx": "Admin dashboard component that uses useAdminCheck hook to verify admin status, redirects non-admin users to home with error toast, and displays tabbed interface for tournament, user, payment, results, and admin management panels.",
  "frontend/src/components/admin/AdminManagementSection.tsx": "Admin management UI component that allows adding/removing admin principals, displaying the current user's principal ID with copy functionality, and enforcing at least one admin must remain.",
  "frontend/src/components/admin/AdminSetup.tsx": "Initial admin setup component for when the admin list is empty, allowing users to copy their principal ID and add themselves as the first admin.",
  "frontend/src/components/admin/PaymentManagementPanel.tsx": "Admin panel for managing pending payment requests (deposits/withdrawals) with approve/reject actions, currently using mock data with backend not yet implemented.",
  "frontend/src/components/admin/ResultsUploadPanel.tsx": "Admin interface for uploading tournament results including tournament selection and top 5 player rankings with kills and prizes, backend not yet implemented.",
  "frontend/src/components/admin/TournamentManagementPanel.tsx": "Admin panel for creating and managing tournaments with form inputs for game mode, entry fee, prize pool, slots, start time, room ID and password, backend not yet implemented.",
  "frontend/src/components/admin/UserManagementPanel.tsx": "Displays a list of registered users with their Free Fire UIDs and tournament participation count using mock data.",
  "frontend/src/components/auth/LoginPage.tsx": "Login page component with Internet Identity authentication, featuring Tournament Khelba branding and Code 11 presentation.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper component that provides consistent Header, Footer, and content container structure for the application.",
  "frontend/src/components/layout/Footer.tsx": "Footer component displaying Tournament Khelba branding, Code 11 logo, quick navigation links, social media icons, and copyright information with a caffeine.ai attribution link.",
  "frontend/src/components/layout/Header.tsx": "Header component with navigation menu, logo, notification bell with unread count badge, user dropdown menu with profile/wallet/rewards links, admin access for authorized users, and logout functionality.",
  "frontend/src/components/leaderboard/LeaderboardPage.tsx": "Leaderboard page displaying mock player rankings with daily/weekly/monthly tabs, showing rank icons (trophy/medal/award for top 3), player stats (points, wins), and demo mode alert indicating backend not yet implemented.",
  "frontend/src/components/notifications/NotificationsPage.tsx": "Notifications page that fetches and displays user notifications with icons based on type (reminder, result, registration, update), timestamps, read/unread status, and mark-as-read functionality with demo mode alert.",
  "frontend/src/components/profile/ProfilePage.tsx": "Profile page showing mock user stats (tournaments played, wins, kills, rank), Free Fire UID with inline editing capability, recent tournament history, and demo mode alert indicating local-only storage.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal dialog for creating or updating user profile with player name and Free Fire UID fields, pre-fills existing data, validates inputs, and calls backend mutation to save profile with success/error toast notifications.",
  "frontend/src/components/referral/ReferralDashboard.tsx": "Displays a referral program dashboard with user's referral code, stats (total referrals, completed referrals, earnings), and a list of referred users. Includes copy-to-clipboard functionality and demo mode alert.",
  "frontend/src/components/results/TournamentResultsPage.tsx": "Shows tournament final standings with player rankings, kills, and prizes. Uses mock data and displays top 3 with trophy icons and gradient backgrounds.",
  "frontend/src/components/squads/CreateSquadModal.tsx": "Modal dialog for creating a new squad with name and tag (2-5 characters) inputs. Validates inputs and calls createSquad mutation on submission.",
  "frontend/src/components/squads/InviteMemberModal.tsx": "Modal dialog for inviting players to a squad by entering their player name or Free Fire UID. Calls inviteSquadMember mutation on submission.",
  "frontend/src/components/squads/SquadsPage.tsx": "Main squad management page showing current squad details, member list, squad invitations, and options to create squad, invite members, or disband. Uses demo data with backend implementation pending.",
  "frontend/src/components/statistics/StatisticsDashboard.tsx": "Displays player statistics dashboard with overview cards (tournaments, wins, win rate, avg kills, earnings) and charts showing performance trends using Recharts. Uses sample data in demo mode.",
  "frontend/src/components/tournaments/CommentsSection.tsx": "Displays a tournament discussion section with comment posting form (for registered users only) and a list of existing comments with timestamps. Uses React Query hooks for fetching and posting comments.",
  "frontend/src/components/tournaments/FeaturedTournamentsSection.tsx": "Renders a horizontal scrollable list of featured tournaments with special styling (yellow/orange gradient borders, featured badges, sponsor info). Each card displays tournament details like prize pool, entry fee, and slots remaining.",
  "frontend/src/components/tournaments/PracticeModeSection.tsx": "Displays a grid of practice mode tournaments with zero entry fees and no prizes. Shows an informational alert explaining practice mode and renders TournamentCard components for each match.",
  "frontend/src/components/tournaments/TournamentCard.tsx": "Reusable card component displaying tournament information (mode, entry fee, prize pool, start time, slots) with conditional styling for practice mode. Includes a link to the tournament detail page.",
  "frontend/src/components/tournaments/TournamentDashboard.tsx": "Main tournament dashboard with hero banner, featured tournaments section, practice mode section, and filterable list of regular tournaments. Includes mode tabs, collapsible filters, and demo mode alerts.",
  "frontend/src/components/tournaments/TournamentDetailPage.tsx": "Detailed tournament page showing comprehensive tournament information, registration button with profile completeness check, and embedded comments section. Handles tournament registration flow and displays mock data with backend alerts.",
  "frontend/src/components/tournaments/TournamentFilters.tsx": "React component that renders a filter panel for tournaments with search, prize pool range, entry fee bracket selection, and displays filtered/total counts.",
  "frontend/src/components/wallet/TransactionList.tsx": "Displays a list of mock wallet transactions (deposits, withdrawals, winnings, entry fees) with icons, status badges, and formatted dates/amounts.",
  "frontend/src/components/wallet/WalletPage.tsx": "Wallet page component showing mock balance, deposit/withdrawal cards with alerts indicating backend is not yet implemented, and includes TransactionList component.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, tournament registration, admin operations, and principal management, with most backend calls stubbed or returning mock data.",
  "frontend/src/hooks/useTournamentFilters.ts": "Custom hook that manages tournament filtering state (search, prize range, fee brackets) and returns filtered tournament list using memoized computation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for dark theme colors (using OKLCH color space), typography settings with Inter font, and utility classes for glow effects (cyan, green, orange).",
  "frontend/src/main.tsx": "React application entry point that sets up the root with QueryClient for data fetching, InternetIdentityProvider for authentication, and renders the main App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and methods to clear sensitive parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with custom OKLCH colors for UI components (border, input, primary, secondary, etc.), gaming neon colors (cyan, green, orange, magenta), glow box shadows, and accordion animations.",
  "project_state.json": "Project metadata for Tournament Khelba, a Free Fire tournament platform on Internet Computer with manual wallet system, tournament management, squad system, and admin panel. Documents architectural decisions, known limitations (no real-time features, no payment gateway integration), and implemented features."
}