{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend Implementation for Admin Access Control System",
  "requirements": [
    {
      "id": "REQ-31",
      "summary": "Update useAdminCheck hook to call backend isAdmin function",
      "acceptanceCriteria": [
        "Hook calls backend isAdmin query function",
        "Returns loading state while checking",
        "Returns boolean result from backend",
        "Handles authentication errors gracefully"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Replace the mock useAdminCheck implementation with a real query that calls actor.isAdmin(). Return loading state from both actor fetching and query loading. Handle cases where actor is not available or user is not authenticated by returning false for isAdmin. Remove the mock 'true' return value and connect to the backend isAdmin query function."
        }
      ]
    },
    {
      "id": "REQ-32",
      "summary": "Block non-admin access to AdminDashboard with redirect and error toast",
      "acceptanceCriteria": [
        "Component checks admin status using useAdminCheck hook",
        "Redirects non-admin users immediately to /tournaments route",
        "Shows error toast with 'Access denied' message",
        "Does not render any admin UI for non-admin users",
        "Shows loading state while checking admin status"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Add useAdminCheck hook call at the top of the component. While isLoading is true, show a loading spinner. Once loaded, if isAdmin is false, immediately redirect to /tournaments using useNavigate and show an error toast with the message 'Access denied: Admin privileges required'. Only render the admin dashboard UI when isAdmin is true. Do not show any admin content to non-admin users."
        }
      ]
    },
    {
      "id": "REQ-33",
      "summary": "Hide Admin navigation link for non-admin users",
      "acceptanceCriteria": [
        "Admin link only renders when useAdminCheck returns true",
        "Link is completely hidden (not just disabled) for non-admins",
        "No visual indication that admin panel exists for non-admin users"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/Header.tsx",
          "operation": "modify",
          "description": "Add useAdminCheck hook call. Conditionally render the Admin navigation link only when isAdmin is true. Do not render the link at all for non-admin users (no disabled state, no placeholder). Ensure the navigation menu remains visually consistent whether the admin link is present or not."
        }
      ]
    },
    {
      "id": "REQ-34",
      "summary": "Create AdminSetup component for initial admin configuration",
      "acceptanceCriteria": [
        "Component displays current user's principal ID fetched from backend getMyPrincipal function",
        "Copy button copies principal ID to clipboard with success toast",
        "Form includes text input for principal ID and 'Add First Admin' button",
        "Form calls backend addAdmin function with provided principal",
        "Component only shows when admin list is empty",
        "Shows success message after adding first admin",
        "Includes clear instructions for the user"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add useGetMyPrincipal hook that queries actor.getMyPrincipal() to fetch the current user's principal ID as text. Enable the query only when actor is available and user is authenticated. Add useAddAdmin mutation hook that calls actor.addAdmin(principalText) and invalidates the admin check query on success."
        },
        {
          "path": "frontend/src/components/admin/AdminSetup.tsx",
          "operation": "create",
          "description": "Create a new component that displays the user's principal ID using useGetMyPrincipal hook. Include a copy-to-clipboard button with toast notification on success. Provide a form with a text input for entering a principal ID and an 'Add First Admin' button that calls the useAddAdmin mutation. Show clear instructions explaining that the admin list is empty and the user should copy their principal ID and add it as the first admin. Display success message after successful addition. Include loading and error states for all operations."
        }
      ]
    },
    {
      "id": "REQ-35",
      "summary": "Add Admin Management section to AdminDashboard",
      "acceptanceCriteria": [
        "Section displays list of all admin principal IDs",
        "Add admin form with text input and submit button",
        "Remove button next to each admin principal with confirmation dialog",
        "Success/error toasts for add/remove operations",
        "Prevents removing the last admin",
        "Refreshes admin list after changes"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add useGetAdminList query hook that fetches the list of admin principals from a backend query function. Add useRemoveAdmin mutation hook that calls actor.removeAdmin(principalText) and invalidates both the admin list and admin check queries on success. Ensure proper error handling for all operations."
        },
        {
          "path": "frontend/src/components/admin/AdminManagementSection.tsx",
          "operation": "create",
          "description": "Create a section component that displays the current list of admin principals using useGetAdminList hook. Include an add admin form with text input and submit button using useAddAdmin mutation. For each admin principal in the list, show a remove button that opens a confirmation dialog before calling useRemoveAdmin mutation. Prevent removing the last admin with client-side validation and appropriate error message. Show success/error toasts for all operations. Refresh the admin list automatically after add/remove operations through query invalidation."
        },
        {
          "path": "frontend/src/components/admin/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Import and render the AdminManagementSection component in the dashboard. Position it prominently as a new tab or section alongside existing management panels. Ensure it is only visible to authenticated admin users."
        }
      ]
    }
  ]
}